balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ16GP304.PIC
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPOR4" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="RPOR4" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP8R" edc:desc="" edc:mask="0x1f" edc:name="RP8R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP9R" edc:desc="" edc:mask="0x1f" edc:name="RP9R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP8R0" edc:desc="" edc:mask="0x1" edc:name="RP8R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP8R1" edc:desc="" edc:mask="0x1" edc:name="RP8R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP8R2" edc:desc="" edc:mask="0x1" edc:name="RP8R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP8R3" edc:desc="" edc:mask="0x1" edc:name="RP8R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP8R4" edc:desc="" edc:mask="0x1" edc:name="RP8R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP9R0" edc:desc="" edc:mask="0x1" edc:name="RP9R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP9R1" edc:desc="" edc:mask="0x1" edc:name="RP9R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP9R2" edc:desc="" edc:mask="0x1" edc:name="RP9R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP9R3" edc:desc="" edc:mask="0x1" edc:name="RP9R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP9R4" edc:desc="" edc:mask="0x1" edc:name="RP9R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPOR5" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="RPOR5" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP10R" edc:desc="" edc:mask="0x1f" edc:name="RP10R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP11R" edc:desc="" edc:mask="0x1f" edc:name="RP11R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP10R0" edc:desc="" edc:mask="0x1" edc:name="RP10R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP10R1" edc:desc="" edc:mask="0x1" edc:name="RP10R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP10R2" edc:desc="" edc:mask="0x1" edc:name="RP10R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP10R3" edc:desc="" edc:mask="0x1" edc:name="RP10R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP10R4" edc:desc="" edc:mask="0x1" edc:name="RP10R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP11R0" edc:desc="" edc:mask="0x1" edc:name="RP11R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP11R1" edc:desc="" edc:mask="0x1" edc:name="RP11R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP11R2" edc:desc="" edc:mask="0x1" edc:name="RP11R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP11R3" edc:desc="" edc:mask="0x1" edc:name="RP11R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP11R4" edc:desc="" edc:mask="0x1" edc:name="RP11R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPOR6" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="RPOR6" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP12R" edc:desc="" edc:mask="0x1f" edc:name="RP12R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP13R" edc:desc="" edc:mask="0x1f" edc:name="RP13R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP12R0" edc:desc="" edc:mask="0x1" edc:name="RP12R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP12R1" edc:desc="" edc:mask="0x1" edc:name="RP12R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP12R2" edc:desc="" edc:mask="0x1" edc:name="RP12R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP12R3" edc:desc="" edc:mask="0x1" edc:name="RP12R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP12R4" edc:desc="" edc:mask="0x1" edc:name="RP12R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP13R0" edc:desc="" edc:mask="0x1" edc:name="RP13R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP13R1" edc:desc="" edc:mask="0x1" edc:name="RP13R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP13R2" edc:desc="" edc:mask="0x1" edc:name="RP13R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP13R3" edc:desc="" edc:mask="0x1" edc:name="RP13R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP13R4" edc:desc="" edc:mask="0x1" edc:name="RP13R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPOR7" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="RPOR7" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP14R" edc:desc="" edc:mask="0x1f" edc:name="RP14R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP15R" edc:desc="" edc:mask="0x1f" edc:name="RP15R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP14R0" edc:desc="" edc:mask="0x1" edc:name="RP14R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP14R1" edc:desc="" edc:mask="0x1" edc:name="RP14R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP14R2" edc:desc="" edc:mask="0x1" edc:name="RP14R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP14R3" edc:desc="" edc:mask="0x1" edc:name="RP14R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP14R4" edc:desc="" edc:mask="0x1" edc:name="RP14R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP15R0" edc:desc="" edc:mask="0x1" edc:name="RP15R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP15R1" edc:desc="" edc:mask="0x1" edc:name="RP15R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP15R2" edc:desc="" edc:mask="0x1" edc:name="RP15R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP15R3" edc:desc="" edc:mask="0x1" edc:name="RP15R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP15R4" edc:desc="" edc:mask="0x1" edc:name="RP15R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPOR8" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="RPOR8" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP16R" edc:desc="" edc:mask="0x1f" edc:name="RP16R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP17R" edc:desc="" edc:mask="0x1f" edc:name="RP17R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP16R0" edc:desc="" edc:mask="0x1" edc:name="RP16R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP16R1" edc:desc="" edc:mask="0x1" edc:name="RP16R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP16R2" edc:desc="" edc:mask="0x1" edc:name="RP16R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP16R3" edc:desc="" edc:mask="0x1" edc:name="RP16R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP16R4" edc:desc="" edc:mask="0x1" edc:name="RP16R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP17R0" edc:desc="" edc:mask="0x1" edc:name="RP17R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP17R1" edc:desc="" edc:mask="0x1" edc:name="RP17R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP17R2" edc:desc="" edc:mask="0x1" edc:name="RP17R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP17R3" edc:desc="" edc:mask="0x1" edc:name="RP17R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP17R4" edc:desc="" edc:mask="0x1" edc:name="RP17R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPOR9" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="RPOR9" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP18R" edc:desc="" edc:mask="0x1f" edc:name="RP18R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP19R" edc:desc="" edc:mask="0x1f" edc:name="RP19R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP18R0" edc:desc="" edc:mask="0x1" edc:name="RP18R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP18R1" edc:desc="" edc:mask="0x1" edc:name="RP18R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP18R2" edc:desc="" edc:mask="0x1" edc:name="RP18R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP18R3" edc:desc="" edc:mask="0x1" edc:name="RP18R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP18R4" edc:desc="" edc:mask="0x1" edc:name="RP18R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP19R0" edc:desc="" edc:mask="0x1" edc:name="RP19R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP19R1" edc:desc="" edc:mask="0x1" edc:name="RP19R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP19R2" edc:desc="" edc:mask="0x1" edc:name="RP19R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP19R3" edc:desc="" edc:mask="0x1" edc:name="RP19R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP19R4" edc:desc="" edc:mask="0x1" edc:name="RP19R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
